Revit 2025 API
RebarBendData.HookLength1 Property
 The extension length of the hook at the end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double HookLength1 { get; set; }
Public Property HookLength1 As Double
	Get
	Set
public:
property double HookLength1 {
	double get ();
	void set (double value);
}
member HookLength1 : float with get, set
Property Value
Double
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace